### Read CSV

In [1]:
import pandas as pd
df = pd.read_csv("stock_data.csv")
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [3]:
df = pd.read_csv('stock_data.csv', skiprows=1)
df
# skips the first row
# same as:
# df = pd.read_csv('stock_data.csv', header =1)

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [6]:
df = pd.read_csv('stock_data.csv', header = None, names = ['tickaaaaaar','eps','revenue','people'])
df

# changes the name of the headers

           tickaaaaaar      eps revenue         people
tickers            eps  revenue   price         people
GOOGL            27.82       87     845     larry page
WMT               4.61      484      65           n.a.
MSFT                -1       85      64     bill gates
RIL      not available       50    1023  mukesh ambani
TATA               5.6       -1    n.a.     ratan tata

In [7]:
df = pd.read_csv('stock_data.csv', nrows=2)
df
# frist two rows after the header

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.

In [16]:
df = pd.read_csv('stock_data.csv')
fourth_row = df.loc[[3]]
fourth_row
# to print a specefic row

  tickers            eps  revenue price         people
3    RIL   not available       50  1023  mukesh ambani

In [18]:
df = pd.read_csv('stock_data.csv' , na_values = ['n.a.', 'not available'])
df

# pandas consider #N/A, -NaN, -n/a, N/A, NULL etc as NaN value. 
# using 'na_values = []' tells pandas to assign the list elements to NaN

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [29]:
df = pd.read_csv('stock_data.csv', na_values = {
    'eps': ['not available'],
    'revenue': [-1],
    'people': ['not available','n.a.']
})
df

# assigns NaN values dpeneding on values of different columns

  tickers    eps  revenue price         people
0   GOOGL  27.82     87.0   845     larry page
1     WMT   4.61    484.0    65            NaN
2    MSFT  -1.00     85.0    64     bill gates
3    RIL     NaN     50.0  1023  mukesh ambani
4    TATA   5.60      NaN  n.a.     ratan tata

### Write to CSV

In [33]:
df.to_csv('newdataa.csv' , index = True)
# creates the file newdataa.csv into my current folder

In [34]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [35]:
df.to_csv('neww.csv', header= False)
# creates the file new.csv into my current folder, without the first row

In [37]:
df.to_csv('newwcolumns.csv',columns= ['tickers','price'], index = False)
# creates the file newwcolumns.csv into my current folder, with only the tickers and price columns

### Read Excel

In [40]:
df = pd.read_excel('stock_data.xlsx', 'Sheet1')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [49]:
# changing different NaN values to chosen ones 

def convert_people_cell(cell):
    if cell == 'n.a.':
        return 'data not available'
    return cell

def convert_price_cell(cell):
    if cell == 'n.a.':
        return 14.8
    return cell
def convert_eps_cell(cell):
    if cell == 'not available':
        return 18.36
    return cell
df = pd.read_excel('stock_data.xlsx', 'Sheet1', converters = {
    'people' : convert_people_cell,
    'price' : convert_price_cell,
    'eps' : convert_eps_cell
})

df.to_excel('newww.xlsx', sheet_name = 'stocks',  startrow=5, startcol=3)
df

  tickers    eps  revenue   price              people
0   GOOGL  27.82       87   845.0          larry page
1     WMT   4.61      484    65.0  data not available
2    MSFT  -1.00       85    64.0          bill gates
3    RIL   18.36       50  1023.0       mukesh ambani
4    TATA   5.60       -1    14.8          ratan tata

### Write To Excel

In [50]:
df.to_excel('mynew.xlsx', sheet_name = 'stocks', index = True)

**writing two dataframes to two seperate sheets in excel**

In [51]:
df_stocks = pd.DataFrame({
    'tickers': ['GOOGL', 'WMT', 'MSFT'],
    'price': [845, 65, 64 ],
    'pe': [30.37, 14.26, 30.97],
    'eps': [27.82, 4.61, 2.12]
})
df_stocks

  tickers  price     pe    eps
0   GOOGL    845  30.37  27.82
1     WMT     65  14.26   4.61
2    MSFT     64  30.97   2.12

In [63]:
df_weather = pd.DataFrame({
    'day': ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature': [32,35,28],
    'event': ['Rain', 'Sunny', 'Snow']
})

df_weather

        day  temperature  event
0  1/1/2017           32   Rain
1  1/2/2017           35  Sunny
2  1/3/2017           28   Snow

In [55]:
with pd.ExcelWriter('mynew.xlsx') as writer:
    df_stocks.to_excel(writer, sheet_name ='stockss', index = False)
    df_weather.to_excel(writer, sheet_name = 'weather')